In [47]:
import pandas as pd

dados1 = {
    'X': [1.3,2.5,3.8,5.1,7],
    'Z': [0.2,0.1,0.3,0.2,0.1],
    'Y': [158,315,450,630,700]
}

dados1 = pd.DataFrame(dados1)

dados2 = {
    'A': [1.3,2.5,3.8,5.1,6],
    'B': [2,1,3,2,1],
    'C': [58,15,50,30,70]
}

dados2 = pd.DataFrame(dados2)

In [48]:
dados3 = pd.merge(dados1,dados2,how='right',left_on='X',right_on='A')

In [49]:
dados3

     X    Z      Y    A  B   C
0  1.3  0.2  158.0  1.3  2  58
1  2.5  0.1  315.0  2.5  1  15
2  3.8  0.3  450.0  3.8  3  50
3  5.1  0.2  630.0  5.1  2  30
4  NaN  NaN    NaN  6.0  1  70

In [60]:
dados4 = pd.concat([dados1,dados3]).drop_duplicates(subset='X',keep=False)

In [61]:
dados4

     X    Z      Y    A    B     C
4  7.0  0.1  700.0  NaN  NaN   NaN
4  NaN  NaN    NaN  6.0  1.0  70.0

In [62]:
dados4 = dados4[['X','Z','Y']]
dados4 = dados4.copy()

In [64]:
dados4.dropna()

     X    Z      Y
4  7.0  0.1  700.0